---
kind: method
id: M:Autodesk.Revit.DB.OpenOptions.#ctor
source: html/caec2e05-cd8e-e978-ac7b-798572c6eddb.htm
---
# Autodesk.Revit.DB.OpenOptions.#ctor Method

Constructs a new instance of the options class using default values.

## Syntax (C#)
```csharp
public OpenOptions()
```